[
  {
    "url": "https://nairametrics.com/2023/10/30/exchange-rate-falls-to-n993-1-lowest-level-ever-on-official-nafem/",
    "extractedText": {
      "title": "Exchange rate falls to N993/$1, lowest level ever on official NAFEM",
      "author": "Chris Ugwu",
      "hostname": "nairametrics.com",
      "date": "2023-10-30",
      "categories": "Breaking News;Currencies",
      "tags": "",
      "fingerprint": "11c552e777ee40c2",
      "id": null,
      "license": null,
      "comments": "Leave a Reply",
      "raw_text": "The exchange rate between the naira and dollar fell to the lowest level ever on NAFEM where forex is sold officially.  This represents a massive 20.5% depreciation marking the lowest level ever recorded by the naira against the dollar.  Before now, the lowest level was N848/$1 recorded on the 17th of October 2023 which represented a one day 8.17% depreciation at the time.  The market also recorded a turnover of $88.3 million a 66% drop from $259.8 million recorded last Friday. Intra-day highs and lows were N998/$1 and N475/$1 respectively. The intra-day low is rather remarkable, and represents a N523/$1 discount to the closing day rate.  The depreciation experienced on the official market is a stark difference from the black market where the exchange rate appears to have appreciated over the last 3 trading days.",
      "text": "The exchange rate between the naira and dollar fell to the lowest level ever on NAFEM where forex is sold officially.\nThis represents a massive 20.5% depreciation marking the lowest level ever recorded by the naira against the dollar.\nBefore now, the lowest level was N848/$1 recorded on the 17th of October 2023 which represented a one day 8.17% depreciation at the time.\nThe market also recorded a turnover of $88.3 million a 66% drop from $259.8 million recorded last Friday. Intra-day highs and lows were N998/$1 and N475/$1 respectively. The intra-day low is rather remarkable, and represents a N523/$1 discount to the closing day rate.\nThe depreciation experienced on the official market is a stark difference from the black market where the exchange rate appears to have appreciated over the last 3 trading days.",
      "language": null,
      "image": "https://nairametrics.com/wp-content/uploads/2023/02/Naira-dollar.webp",
      "pagetype": "article",
      "source": "https://nairametrics.com/2023/10/30/exchange-rate-falls-to-n993-1-lowest-level-ever-on-official-nafem/",
      "source-hostname": null,
      "excerpt": "The exchange rate between the naira and dollar fell to the lowest level ever on NAFEM where forex is sold officially.",
      "word-count": 1
    }
  },
  {
    "url": "https://www.osundefender.com/naira-further-appreciates-to-n1150-1-at-parallel-fx-market/",
    "extractedText": {
      "title": "Naira Further Appreciates To N1,150/$1 At Parallel FX Market - OsunDefender",
      "author": "Sodiq Yusuf",
      "hostname": "osundefender.com",
      "date": "2023-10-30",
      "categories": "Economy, Naira/Dollar Rate",
      "tags": "",
      "fingerprint": "600e9b7fe6b8cfe8",
      "id": null,
      "license": null,
      "comments": "",
      "raw_text": "Naira Further Appreciates To N1,150/$1 At Parallel FX Market  The Nigerian Naira, on Monday, appreciated further at the parallel section of the market to N1,150 a dollar.  Today’s development signals an appreciation of N80 or 6.5 percent compared to the N1,230 it traded last Friday.  Currency traders, also known as Bureaux De Change operators (BDCs), told newsmen in Lagos that the scarcity of the dollar was beginning to have its resultant effect on the black market.  The traders put the buying price of the dollar at N1,120 and the selling price at N1,150 — leaving a profit margin of N30.  “Dollar is gradually returning to the market. We are seeing more dollars,” a trader who identified himself as Aliyu said. Sodiq Yusuf is a trained media practitioner and journalist with considerable years of experience in print, broadcast, and digital journalism. His interests cover a wide range of causes in politics, governance, sports, community development, and good governance.",
      "text": "Naira Further Appreciates To N1,150/$1 At Parallel FX Market\nThe Nigerian Naira, on Monday, appreciated further at the parallel section of the market to N1,150 a dollar.\nToday’s development signals an appreciation of N80 or 6.5 percent compared to the N1,230 it traded last Friday.\nCurrency traders, also known as Bureaux De Change operators (BDCs), told newsmen in Lagos that the scarcity of the dollar was beginning to have its resultant effect on the black market.\nThe traders put the buying price of the dollar at N1,120 and the selling price at N1,150 — leaving a profit margin of N30.\n“Dollar is gradually returning to the market. We are seeing more dollars,” a trader who identified himself as Aliyu said.\nSodiq Yusuf is a trained media practitioner and journalist with considerable years of experience in print, broadcast, and digital journalism. His interests cover a wide range of causes in politics, governance, sports, community development, and good governance.",
      "language": null,
      "image": "https://www.osundefender.com/wp-content/uploads/2023/09/NAIRA-DOLLAR-SCHEME-700x422-1.jpg",
      "pagetype": "article",
      "source": "https://www.osundefender.com/naira-further-appreciates-to-n1150-1-at-parallel-fx-market/",
      "source-hostname": "OsunDefender - Osun Defender",
      "excerpt": "The Nigerian Naira, on Monday, appreciated further at the parallel section of the market to N1,150 a dollar. Today's development signals an appreciation of N80 or 6.5 percent compared to the N1,230 it traded last Friday. Currency traders, also known as Bureaux De Change operators (BDCs), told newsmen in Lagos that the scarcity of the dollar was",
      "word-count": 1
    }
  },
  {
    "url": "https://businessday.ng/news/article/naira-gains-dollar-falls-further-to-n1170/",
    "extractedText": {
      "title": "Naira gains Dollar falls further to N1,170",
      "author": "Hope Moses-Ashike",
      "hostname": "businessday.ng",
      "date": "2023-10-30",
      "categories": "Currency Watch;Markets;News",
      "tags": "",
      "fingerprint": "eb8a4ac34fb8c700",
      "id": null,
      "license": null,
      "comments": "",
      "raw_text": "Naira on Monday gained further by 2.5 per cent as the dollar fell to N1,170 on the parallel market. During the trading session on Monday, the dollar was quoted at N1,170, which was stronger than the N1,200 quoted on Friday. Before strengthening to N1,200 per dollar on Friday, the naira had early last week hit a record low of N1,310 per dollar following strong demand on the parallel market, also known as the black market. Traders attributed the naira appreciation to some government-announced policies, which have put speculators in an uncertain state. Read also NLC demands urgent stabilisation of Naira Nigeria’s government plans to digitalise FX transactions and discourage speculative demands and hoarding of FX in cash. The foreign exchange (FX) market ended the five trading days of last week with naira closing strong against the dollar across the market segments. On day-to-day trading, the naira appreciated by 5.68 percent as the dollar was quoted at N789.94 on Friday compared to N837.49 on Thursday at the Nigerian Autonomous Foreign Exchange Market (NAFEM), data from the FMDQ indicated. The FX market recorded significant dollar flows from willing buyers and willing sellers. Consequently, the daily foreign exchange market turnover, which reflects the volume of transactions in the market, rose significantly by over 100 per cent (129.50%) to $259.84 million on Friday from $113.22 million on Thursday.",
      "text": "Naira on Monday gained further by 2.5 per cent as the dollar fell to N1,170 on the parallel market.\nDuring the trading session on Monday, the dollar was quoted at N1,170, which was stronger than the N1,200 quoted on Friday.\nBefore strengthening to N1,200 per dollar on Friday, the naira had early last week hit a record low of N1,310 per dollar following strong demand on the parallel market, also known as the black market.\nTraders attributed the naira appreciation to some government-announced policies, which have put speculators in an uncertain state.\nRead also NLC demands urgent stabilisation of Naira\nNigeria’s government plans to digitalise FX transactions and discourage speculative demands and hoarding of FX in cash.\nThe foreign exchange (FX) market ended the five trading days of last week with naira closing strong against the dollar across the market segments.\nOn day-to-day trading, the naira appreciated by 5.68 percent as the dollar was quoted at N789.94 on Friday compared to N837.49 on Thursday at the Nigerian Autonomous Foreign Exchange Market (NAFEM), data from the FMDQ indicated.\nThe FX market recorded significant dollar flows from willing buyers and willing sellers.\nConsequently, the daily foreign exchange market turnover, which reflects the volume of transactions in the market, rose significantly by over 100 per cent (129.50%) to $259.84 million on Friday from $113.22 million on Thursday.",
      "language": null,
      "image": "https://businessday.ng/wp-content/uploads/2022/06/Naira-to-dollar-1.jpg",
      "pagetype": "article",
      "source": "https://businessday.ng/news/article/naira-gains-dollar-falls-further-to-n1170/",
      "source-hostname": "BusinessDay Media Limited",
      "excerpt": "Naira on Monday gained further by 2.5 per cent as the dollar fell to N1,170 on the parallel market. During the trading session on Monday, the dollar was",
      "word-count": 1
    }
  },
  {
    "url": "https://businesspost.ng/economy/nigeria-exchange-soars-1-45-on-solid-q3-results/",
    "extractedText": {
      "title": "Nigeria Exchange Soars 1.45% on Solid Q3 Results",
      "author": "Dipo Olowookere",
      "hostname": "businesspost.ng",
      "date": "2023-10-31",
      "categories": "Economy",
      "tags": "",
      "fingerprint": "3b216c19d3d81b8",
      "id": null,
      "license": null,
      "comments": "",
      "raw_text": "Nigeria Exchange Soars 1.45% on Solid Q3 Results  By Dipo Olowookere  The first trading session at the Nigerian Exchange (NGX) Limited ended bullish on Monday with a 1.45 per cent growth inspired by sustained buying pressure.  Investors showed renewed interest in the local stock market as a result of the solid third-quarter earnings of companies listed on the trading platform.  It was observed that traders were mopping up shares of organisations across the sectors and categories in anticipation of higher return on investment in the coming weeks.  Analysis of the data from the bourse indicated that 45 equities were on the price gainers’ log and 16 stocks finished on the losers’ chart, representing a positive market breadth and a strong investor sentiment.  Northern Nigerian Flour Mills closed as the best-performing stock yesterday after it grew its value by 10.00 per cent to N18.15, and Chellarams rose by 9.77 per cent to N3.82. UAC Nigeria improved by 9.54 per cent to N14.35, NAHCO gained 9.45 per cent to trade at N26.05, and The Initiates increased by 9.43 per cent to N1.16.  On the flip side, Meyer lost 9.87 per cent to finish at N2.74, Abbey Mortgage Bank declined by 9.71 per cent to close at N1.86, Regency Assurance fell by 8.33 per cent to 33 Kobo, RT Briscoe fell by 6.00 per cent to 47 Kobo, and Jaiz Bank depleted by 5.95 per cent to N1.58.  Business Post reports that apart from the energy index which closed flat, every other sector ended in the green territory, with the industrial goods space rising by 2.99 per cent.  Further, the banking sector improved by 1.20 per cent, the insurance counter appreciated by 0.86 per cent, and the consumer goods space increased by 0.44 per cent.  Consequently, the All-Share Index (ASI) jumped by 975.13 points to 68,111.71 points from 67,136.58 points and the market capitalisation grew by N536 billion to N37.421 trillion from N36.885 trillion.  The market was very busy on Monday, with the trading volume, value and the number of deals growing by 100.93 per cent, 59.62 per cent and 43.77 per cent, respectively.  Investors transacted 430.4 million shares worth N8.3 billion in 7,656 deals compared with the 214.2 million shares worth N5.2 billion transacted in 5,325 deals in the preceding trading session.  Universal Insurance closed the day as the busiest stock after it traded 94.3 million units for N23.1 million, UBA sold 51.3 million units for N1.0 billion, Custodian Investment transacted 33.3 million units valued at N242.0 million, Transcorp exchanged 32.5 million units worth N200.9 million, and Zenith Bank traded 24.4 million units valued at N818.5 million.",
      "text": "Nigeria Exchange Soars 1.45% on Solid Q3 Results\nBy Dipo Olowookere\nThe first trading session at the Nigerian Exchange (NGX) Limited ended bullish on Monday with a 1.45 per cent growth inspired by sustained buying pressure.\nInvestors showed renewed interest in the local stock market as a result of the solid third-quarter earnings of companies listed on the trading platform.\nIt was observed that traders were mopping up shares of organisations across the sectors and categories in anticipation of higher return on investment in the coming weeks.\nAnalysis of the data from the bourse indicated that 45 equities were on the price gainers’ log and 16 stocks finished on the losers’ chart, representing a positive market breadth and a strong investor sentiment.\nNorthern Nigerian Flour Mills closed as the best-performing stock yesterday after it grew its value by 10.00 per cent to N18.15, and Chellarams rose by 9.77 per cent to N3.82. UAC Nigeria improved by 9.54 per cent to N14.35, NAHCO gained 9.45 per cent to trade at N26.05, and The Initiates increased by 9.43 per cent to N1.16.\nOn the flip side, Meyer lost 9.87 per cent to finish at N2.74, Abbey Mortgage Bank declined by 9.71 per cent to close at N1.86, Regency Assurance fell by 8.33 per cent to 33 Kobo, RT Briscoe fell by 6.00 per cent to 47 Kobo, and Jaiz Bank depleted by 5.95 per cent to N1.58.\nBusiness Post reports that apart from the energy index which closed flat, every other sector ended in the green territory, with the industrial goods space rising by 2.99 per cent.\nFurther, the banking sector improved by 1.20 per cent, the insurance counter appreciated by 0.86 per cent, and the consumer goods space increased by 0.44 per cent.\nConsequently, the All-Share Index (ASI) jumped by 975.13 points to 68,111.71 points from 67,136.58 points and the market capitalisation grew by N536 billion to N37.421 trillion from N36.885 trillion.\nThe market was very busy on Monday, with the trading volume, value and the number of deals growing by 100.93 per cent, 59.62 per cent and 43.77 per cent, respectively.\nInvestors transacted 430.4 million shares worth N8.3 billion in 7,656 deals compared with the 214.2 million shares worth N5.2 billion transacted in 5,325 deals in the preceding trading session.\nUniversal Insurance closed the day as the busiest stock after it traded 94.3 million units for N23.1 million, UBA sold 51.3 million units for N1.0 billion, Custodian Investment transacted 33.3 million units valued at N242.0 million, Transcorp exchanged 32.5 million units worth N200.9 million, and Zenith Bank traded 24.4 million units valued at N818.5 million.",
      "language": null,
      "image": "https://businesspost.ng/wp-content/uploads/2021/09/Nigerian-Exchange-1.png",
      "pagetype": "article",
      "source": "https://businesspost.ng/economy/nigeria-exchange-soars-1-45-on-solid-q3-results/",
      "source-hostname": "Business Post Nigeria",
      "excerpt": "<p>By Dipo Olowookere The first trading session at the Nigerian Exchange (NGX) Limited ended bullish on Monday with a 1.45 per cent growth inspired by sustained buying pressure. Investors showed renewed interest in the local stock market as a result of the solid third-quarter earnings of companies listed on the trading platform. It was observed that traders were mopping up shares of organisations across the sectors and categories in anticipation of higher return on investment in the coming weeks. Analysis of the data from the bourse indicated that 45 equities were on the price gainers’ log and 16 stocks finished</p>",
      "word-count": 1
    }
  },
  {
    "url": "https://www.thisdaylive.com/index.php/2023/10/31/fg-mulls-cassava-as-import-substitution-for-wheat-flour-bio-oil",
    "extractedText": {
      "title": "FG Mulls Cassava as Import Substitution for Wheat Flour, Bio-Oil",
      "author": null,
      "hostname": "thisdaylive.com",
      "date": "2023-10-31",
      "categories": "",
      "tags": "",
      "fingerprint": "4de19559849cc6aa",
      "id": null,
      "license": null,
      "comments": "",
      "raw_text": "Gilbert Ekugbe  The Federal Ministry of Agriculture and Food Security (FMAFS) has declared Nigeria’s determination to take advantage of being the largest producer of cassava in the world to substitute large quantity of wheat flour, corn starch and bio-oil currently being imported in large quantities into the country.  The Minister of Agriculture and Food Security, Sen. Abubakar Kyari, said that the present administration would tackle various challenges from the level of activities in production, processing or marketing, including the 2-3 year cycle of glut and scarcity that causes fluctuations in price of the commodity to achieve this objective.  The minister stated this at the 3-day African Cassava Conference hosted by Nigeria in Abuja.  He said that major challenges to the production of high-quality cassava flour (HQCF) included high cost of flash dryer, high level maintenance and inefficiency of locally fabricated flash dryers which affect the quality of the output.  He advocated for continued sensitisation and training of stakeholders on the use of 20 per cent HQCF in bread baking and other confectionaries; need for small scale/cottage flash dryer; improved locally fabricated flash dryers for improved quality of the HQCF as a way forward in the subsector.  “Providing good quality cassava derivatives will facilitate increase in local and export demand of the product leading to enhanced efficiency and production of the crop. The outcome of the conference will no doubt bring about increase in the average yields in cassava; enhance stakeholders’ revenues; incorporate quality control inspection and certification systems; encourage appropriate technology for rapid multiplication of the cassava and create jobs and wealth for the Nigeria citizens,” he said.  Kyari described cassava as a staple food for millions of Nigerians that is grown in the 36 states of the federation as well as the Federal Capital Territory (FCT).  Also speaking, the Chairman and Chief Executive, National Quality Council (NQC), Osita Aboloma, highlighted the importance of national policies in his keynote presentation titled “The Role of National Governments and National Quality Infrastructure Institutions in the Development of the Cassava Value Chain.”  Aboloma posited that national governments in Africa are strategic to achieving the theme of the conference, which was to stimulate Africa’s industrialisation through the development of cassava based products and assuring quality along the value chain.  According to him, given the prevalence of the cassava crop in the entire African continent, developing the value chain for food security, nutrition as well as industrialisation purposes require the collaboration of governments at local, state and the federal levels for optimum gain.",
      "text": "Gilbert Ekugbe\nThe Federal Ministry of Agriculture and Food Security (FMAFS) has declared Nigeria’s determination to take advantage of being the largest producer of cassava in the world to substitute large quantity of wheat flour, corn starch and bio-oil currently being imported in large quantities into the country.\nThe Minister of Agriculture and Food Security, Sen. Abubakar Kyari, said that the present administration would tackle various challenges from the level of activities in production, processing or marketing, including the 2-3 year cycle of glut and scarcity that causes fluctuations in price of the commodity to achieve this objective.\nThe minister stated this at the 3-day African Cassava Conference hosted by Nigeria in Abuja.\nHe said that major challenges to the production of high-quality cassava flour (HQCF) included high cost of flash dryer, high level maintenance and inefficiency of locally fabricated flash dryers which affect the quality of the output.\nHe advocated for continued sensitisation and training of stakeholders on the use of 20 per cent HQCF in bread baking and other confectionaries; need for small scale/cottage flash dryer; improved locally fabricated flash dryers for improved quality of the HQCF as a way forward in the subsector.\n“Providing good quality cassava derivatives will facilitate increase in local and export demand of the product leading to enhanced efficiency and production of the crop. The outcome of the conference will no doubt bring about increase in the average yields in cassava; enhance stakeholders’ revenues; incorporate quality control inspection and certification systems; encourage appropriate technology for rapid multiplication of the cassava and create jobs and wealth for the Nigeria citizens,” he said.\nKyari described cassava as a staple food for millions of Nigerians that is grown in the 36 states of the federation as well as the Federal Capital Territory (FCT).\nAlso speaking, the Chairman and Chief Executive, National Quality Council (NQC), Osita Aboloma, highlighted the importance of national policies in his keynote presentation titled “The Role of National Governments and National Quality Infrastructure Institutions in the Development of the Cassava Value Chain.”\nAboloma posited that national governments in Africa are strategic to achieving the theme of the conference, which was to stimulate Africa’s industrialisation through the development of cassava based products and assuring quality along the value chain.\nAccording to him, given the prevalence of the cassava crop in the entire African continent, developing the value chain for food security, nutrition as well as industrialisation purposes require the collaboration of governments at local, state and the federal levels for optimum gain.",
      "language": null,
      "image": "https://global.ariseplay.com/amg/www.thisdaylive.com/uploads/Abubakar-Kyari.jpg",
      "pagetype": null,
      "source": "https://www.thisdaylive.com/index.php/2023/10/31/fg-mulls-cassava-as-import-substitution-for-wheat-flour-bio-oil",
      "source-hostname": "thisdaylive.com",
      "excerpt": null,
      "word-count": 1
    }
  },
  {
    "url": "https://www.industryweek.com/the-economy/article/21276415/us-fed-likely-to-pause-again-with-rates-at-22year-high",
    "extractedText": {
      "title": "Please Enable Cookies",
      "author": null,
      "hostname": "industryweek.com",
      "date": "2023-01-01",
      "categories": "",
      "tags": "",
      "fingerprint": "5a50e4d831e070ad",
      "id": null,
      "license": null,
      "comments": "",
      "raw_text": "Please Enable Cookies www.industryweek.com is using a security service for protection against online attacks. The service requires full cookie support in order to view this website. Please enable cookies on your browser and try again. www.industryweek.com is using a security service for protection against online attacks. This process is automatic. You will be redirected once the validation is complete.",
      "text": "Please Enable Cookies\nwww.industryweek.com is using a security service for protection against online attacks. The service requires full cookie support in order to view this website.\nPlease enable cookies on your browser and try again.\nwww.industryweek.com is using a security service for protection against online attacks. This process is automatic. You will be redirected once the validation is complete.",
      "language": null,
      "image": null,
      "pagetype": null,
      "source": "https://www.industryweek.com/the-economy/article/21276415/us-fed-likely-to-pause-again-with-rates-at-22year-high",
      "source-hostname": "industryweek.com",
      "excerpt": null,
      "word-count": 1
    }
  },
  {
    "url": "https://sunnewsonline.com/access-bank-to-drive-business-empowerment-with-specialised-products-services/",
    "extractedText": {
      "title": "Access Bank to drive business empowerment with specialised products, services – The Sun Nigeria",
      "author": "Rapheal",
      "hostname": "sunnewsonline.com",
      "date": "2023-10-30",
      "categories": "National;Cover;Politics;Business;Sports;News;Food & Drinks;Gallery;Letters;Sporting Sun;Columns;World News;Features;Cartoons;Press Release;Sun Girl;Travel & Tourism;Trending;Entertainment;Events;Health;Lifestyle;Opinion;TSWeekend;Voices;World",
      "tags": "the sun, sun newspaper, nigerian news, politics, entertainment, business, politics, 2023 Governorship Election",
      "fingerprint": "6e12e5f94eb122a2",
      "id": null,
      "license": null,
      "comments": "",
      "raw_text": "By Omodele Adigun In with the vision of Access Bank Development Banking Desk to drive economic empowerment and financial inclusion, it has declared its intension to provide specialised financial products and services to businesses, NGOs and institutions. According to its Executive Director, Commercial Bank Division, Hadiza Ambursa, who disclosed this at a press briefing in Lagos, through the initiative, the desk aims to support and nurture the growth of these entities, fostering a robust entrepreneurial ecosystem in Nigeria and beyond. She added: “This initiative is in line with the bank’s vision of being the world’ most respected African bank with an unwavering dedication and commitment to fostering positive change, herald development and making a lasting impact in the finance, business, community, organisations, and industry it serves by solidifying its status as a key development finance leader and partner for non-profit organisations and institutions on the continent. Expressing her zeal about the revamped Development Desk and its potential impact on Nigeria’s economic landscape, Ambursa stated that the bank’s vision is to drive economic empowerment and financial inclusion by providing specialised financial products and services to businesses, NGOs and institutions.  “As the foremost financial powerhouse, we hope to achieve our audacious goals in Development Banking as a preferred banking partner for non-profit organisations already in Nigeria and all other countries where we have presence and those hoping to come by helping to boost bilateral and multilateral banking relationships, manage the donor funds and the programs the funds are meant for, support projects and initiatives that are channeled towards the common good of the public like charitable activities, climate change, poverty reduction, improved quality of education, improved health and to play a crucial role in financing projects that contribute to achieving the bank’s goals as well as creating a one stop shop for the unique needs of Not-For- Profit sector. Also, our dedicated team will assist in writing bespoke proposals for the NGOs and based on market insights we would create new product offerings such as corporate accounts with concessions, conditional cash transfers, primus-plus, Advisory services and services that would resolve new problems arising with the changing market climate while we sustain the desk with data driven market intelligence that will constantly improve our day-to-day collaboration with relevant agencies and engage the relevant stakeholders to understand their challenges, concerns and opportunities to co-create financial solutions that will meet the unique emerging needs of the not-for-profit organisation in Nigeria and indeed across the African continent just as we will advocate for regulatory reforms that best support developmental initiatives and give quality advisory services.” In the same vein, Head, Development Banking Desk, Ambur Sule, said ‘’The Development Desk serves as a conduit for global funds and resources, bolstering the banks influence in the African region and fortifying Nigeria’s position on the international development stage.’’ Ambur stressed that, as the bank moves toward a more interconnected world, its role as a development finance leader and partner becomes increasingly vital. Sule said, “Our collaborations with esteemed NGOs and Institutions as a partner are instrumental in driving inclusive growth, deepening financial inclusion, reducing poverty, and boosting infrastructure development in Nigeria.”’",
      "text": "By Omodele Adigun\nIn with the vision of Access Bank Development Banking Desk to drive economic empowerment and financial inclusion, it has declared its intension to provide specialised financial products and services to businesses, NGOs and institutions.\nAccording to its Executive Director, Commercial Bank Division, Hadiza Ambursa, who disclosed this at a press briefing in Lagos, through the initiative, the desk aims to support and nurture the growth of these entities, fostering a robust entrepreneurial ecosystem in Nigeria and beyond.\nShe added: “This initiative is in line with the bank’s vision of being the world’ most respected African bank with an unwavering dedication and commitment to fostering positive change, herald development and making a lasting impact in the finance, business, community, organisations, and industry it serves by solidifying its status as a key development finance leader and partner for non-profit organisations and institutions on the continent.\nExpressing her zeal about the revamped Development Desk and its potential impact on Nigeria’s economic landscape, Ambursa stated that the bank’s vision is to drive economic empowerment and financial inclusion by providing specialised financial products and services to businesses, NGOs and institutions.\n“As the foremost financial powerhouse, we hope to achieve our audacious goals in Development Banking as a preferred banking partner for non-profit organisations already in Nigeria and all other countries where we have presence and those hoping to come by helping to boost bilateral and multilateral banking relationships, manage the donor funds and the programs the funds are meant for, support projects and initiatives that are channeled towards the common good of the public like charitable activities, climate change, poverty reduction, improved quality of education, improved health and to play a crucial role in financing projects that contribute to achieving the bank’s goals as well as creating a one stop shop for the unique needs of Not-For- Profit sector.\nAlso, our dedicated team will assist in writing bespoke proposals for the NGOs and based on market insights we would create new product offerings such as corporate accounts with concessions, conditional cash transfers, primus-plus, Advisory services and services that would resolve new problems arising with the changing market climate while we sustain the desk with data driven market intelligence that will constantly improve our day-to-day collaboration with relevant agencies and engage the relevant stakeholders to understand their challenges, concerns and opportunities to co-create financial solutions that will meet the unique emerging needs of the not-for-profit organisation in Nigeria and indeed across the African continent just as we will advocate for regulatory reforms that best support developmental initiatives and give quality advisory services.”\nIn the same vein, Head, Development Banking Desk, Ambur Sule, said ‘’The Development Desk serves as a conduit for global funds and resources, bolstering the banks influence in the African region and fortifying Nigeria’s position on the international development stage.’’\nAmbur stressed that, as the bank moves toward a more interconnected world, its role as a development finance leader and partner becomes increasingly vital.\nSule said, “Our collaborations with esteemed NGOs and Institutions as a partner are instrumental in driving inclusive growth, deepening financial inclusion, reducing poverty, and boosting infrastructure development in Nigeria.”’",
      "language": null,
      "image": "https://assets.sunnewsonline.com/2023/02/Access-Bank-678x381-1.jpg",
      "pagetype": "article",
      "source": "https://sunnewsonline.com/access-bank-to-drive-business-empowerment-with-specialised-products-services/",
      "source-hostname": "The Sun Nigeria",
      "excerpt": "By Omodele Adigun In with the vision of Access Bank Development Banking Desk to drive economic empowerment and financial inclusion, it has declared its intension to provide specialised financial products and services to businesses, NGOs and institutions. According to its Executive Director, Commercial Bank Division, Hadiza Ambursa, who disclosed this at a press briefing in […]",
      "word-count": 1
    }
  },
  {
    "url": "https://brandspurng.com/2023/10/30/shelter-afrique-development-bank-extends-us12m-loan-to-vista-bank-guinee/",
    "extractedText": {
      "title": "Shelter Afrique Development Bank Extends US$12m Loan To Vista Bank Guinee",
      "author": "Brand Spur",
      "hostname": "brandspurng.com",
      "date": "2023-10-30",
      "categories": "Brand News",
      "tags": "",
      "fingerprint": "5ce72051acd61aff",
      "id": null,
      "license": null,
      "comments": "",
      "raw_text": "Shelter Afrique Development Bank (ShafDB) Board has approved a line of credit worth US$12 million in housing loan to Conakry-based Vista Bank Guinee SA. Vista Bank Guinee SA will use the line of credit to finance a portion of its customer base, namely real estate developers and construction companies involved in the provision of affordable housing in the Republic of Guinea including Small and Medium Enterprises (SMEs) in the housing value chain. The use of the funds will also be extended to individual customers of Vista Bank for housing construction and renovations. Shelter Afrique Development Bank Managing Director Mr. Thierno Habib Hann said the facility to Vista Bank Guinee was aligned with institution’s strategic goal of financial stability, enhancing shareholders’ value across the value chain, development impact, and affordability.  “The agreement marks the initial stride in tackling the housing-deficit in the Republic of Guinea, with Shelter Afrique Development Bank (ShafDB) – enhancing its development influence to its Member States by providing cost-effective housing solutions” stated Mr. Hann. Vista Bank Guinee Managing Director, Mr Tirmidjiou Diallo said approval of the line of credit by Shelter Afrique marks the beginning of a long partnership between the two institutions, adding that the Bank had already secured a healthy pipeline of developers for the facility. “Several projects are taking place, most notably a project that will begin implementing 1000 housing units’, whereby the first 200 units will benefit from this financing” Mr Diallo said. Under the loan agreement, the identified developers will have a maximum of 2 years to execute the projects. Once completed the developer’s clients (units’ beneficiaries) will be granted a maximum of 8 years to repay the developers. “We believe the 10-year tenure will allow developers to offer attractive payment conditions to their clients and enhance affordability,” Mr. Hann said. The loan is guaranteed by Vista Group Holdings SA, Vista Bank Guinee parent company headquartered in Burkina Faso with offices in The Gambia, Sierra Leone, Guinee, and Burkina Faso.",
      "text": "Shelter Afrique Development Bank (ShafDB) Board has approved a line of credit worth US$12 million in housing loan to Conakry-based Vista Bank Guinee SA.\nVista Bank Guinee SA will use the line of credit to finance a portion of its customer base, namely real estate developers and construction companies involved in the provision of affordable housing in the Republic of Guinea including Small and Medium Enterprises (SMEs) in the housing value chain. The use of the funds will also be extended to individual customers of Vista Bank for housing construction and renovations.\nShelter Afrique Development Bank Managing Director Mr. Thierno Habib Hann said the facility to Vista Bank Guinee was aligned with institution’s strategic goal of financial stability, enhancing shareholders’ value across the value chain, development impact, and affordability.\n“The agreement marks the initial stride in tackling the housing-deficit in the Republic of Guinea, with Shelter Afrique Development Bank (ShafDB) – enhancing its development influence to its Member States by providing cost-effective housing solutions” stated Mr. Hann.\nVista Bank Guinee Managing Director, Mr Tirmidjiou Diallo said approval of the line of credit by Shelter Afrique marks the beginning of a long partnership between the two institutions, adding that the Bank had already secured a healthy pipeline of developers for the facility.\n“Several projects are taking place, most notably a project that will begin implementing 1000 housing units’, whereby the first 200 units will benefit from this financing” Mr Diallo said.\nUnder the loan agreement, the identified developers will have a maximum of 2 years to execute the projects. Once completed the developer’s clients (units’ beneficiaries) will be granted a maximum of 8 years to repay the developers.\n“We believe the 10-year tenure will allow developers to offer attractive payment conditions to their clients and enhance affordability,” Mr. Hann said.\nThe loan is guaranteed by Vista Group Holdings SA, Vista Bank Guinee parent company headquartered in Burkina Faso with offices in The Gambia, Sierra Leone, Guinee, and Burkina Faso.",
      "language": null,
      "image": "https://i0.wp.com/brandspurng.com/wp-content/uploads/2023/10/Image1.jpg?fit=1280%2C960&ssl=1",
      "pagetype": "article",
      "source": "https://brandspurng.com/2023/10/30/shelter-afrique-development-bank-extends-us12m-loan-to-vista-bank-guinee/",
      "source-hostname": "Brand Spur Nigeria",
      "excerpt": "Shelter Afrique Development Bank (ShafDB) Board has approved a line of credit worth US$12 million in housing",
      "word-count": 1
    }
  },
  {
    "url": "https://punchng.com/consumers-lament-hike-in-gas-price/",
    "extractedText": {
      "title": "Consumers lament hike in gas price",
      "author": "Our Reporters",
      "hostname": "punchng.com",
      "date": "2023-10-30",
      "categories": "Metro Plus",
      "tags": "",
      "fingerprint": "f0a79b932bb0cd4d",
      "id": null,
      "license": null,
      "comments": "",
      "raw_text": "Residents of Mowe in the Obafemi Owode Local Government Area of Ogun State have lamented the hike in the price of cooking gas which they claim has affected their standard of living.  PUNCH Metro gathered that the high rate of gas price had caused hardship in the community and the rise in the dollar exchange rate with the naira which has affected the price of commodities was the excuse cooking gas traders in the locality were giving to their displeased customers.  A trader, who identified himself as Chinedu, said the price of cooking gas had affected his business which resulted into the reduction of the snacks size, leaving the customers disappointed anytime they patronised him.  “Before the increment of cooking gas price, it was purchased at rates ranging from N600 to N650 per litre but as of now, it has increased to N1,200, while the gas plant nearby sells at the rate of N900 per litre,” Chinedu said.  When PUNCH Metro spoke with a gas attendant, Oluwatobiloba, he said, “When I started this business, I was selling cooking gas at N250 per litre and now it is N1,200. There have been low sales since the increase in price.  “Consumers now make use of firewood, charcoal and sawdust as fuel for cooking because they are not financially capable.”",
      "text": "Residents of Mowe in the Obafemi Owode Local Government Area of Ogun State have lamented the hike in the price of cooking gas which they claim has affected their standard of living.\nPUNCH Metro gathered that the high rate of gas price had caused hardship in the community and the rise in the dollar exchange rate with the naira which has affected the price of commodities was the excuse cooking gas traders in the locality were giving to their displeased customers.\nA trader, who identified himself as Chinedu, said the price of cooking gas had affected his business which resulted into the reduction of the snacks size, leaving the customers disappointed anytime they patronised him.\n“Before the increment of cooking gas price, it was purchased at rates ranging from N600 to N650 per litre but as of now, it has increased to N1,200, while the gas plant nearby sells at the rate of N900 per litre,” Chinedu said.\nWhen PUNCH Metro spoke with a gas attendant, Oluwatobiloba, he said, “When I started this business, I was selling cooking gas at N250 per litre and now it is N1,200. There have been low sales since the increase in price.\n“Consumers now make use of firewood, charcoal and sawdust as fuel for cooking because they are not financially capable.”",
      "language": null,
      "image": "https://cdn.punchng.com/wp-content/uploads/2016/07/09130858/gas-cylinders-lub-gas.jpg",
      "pagetype": "article",
      "source": "https://punchng.com/consumers-lament-hike-in-gas-price/",
      "source-hostname": "Punch Newspapers",
      "excerpt": "Residents of Mowe in the Obafemi Owode Local Government Area of Ogun State have lamented the hike in the price of cooking gas which they claim has affected their standard of living.",
      "word-count": 1
    }
  }
]
