[
  {
    "url": "https://dailypost.ng/2023/11/05/fg-plans-special-police-force-on-illegal-mining/",
    "extractedText": {
      "title": "FG plans special police force on illegal mining",
      "author": "John Owen Nwachukwu",
      "hostname": "dailypost.ng",
      "date": "2023-11-05",
      "categories": "Business",
      "tags": "",
      "fingerprint": "d663dda1e9b5e403",
      "id": null,
      "license": null,
      "comments": "",
      "raw_text": "Business  FG plans special police force on illegal mining  The Federal Government has disclosed plans to create a special police outfit for the sole purpose of combating illegal mining across the country.  The Minister of Solid Minerals Development, Mr. Dele Alake disclosed this while speaking on the NTA Weekend File on strategies to be deployed by the Federal Government to increase the contribution of mining to the economy.  While responding to questions concerning challenges in the mining sector, Alake said the issue of insecurity will be handled through collaboration with different security agencies and the establishment of a special police outfit for that purpose. “We found out through intelligence reports that some illegal miners are directly responsible for the upsurge of banditry in several parts of Nigeria,” he said.  “That is why I have been working with the various security agencies and the National security adviser, the outfit we are coming up with, and the President is fully in support of this.  “We are going to create a special police outfit. We’ll call it the Mining Police Force or the Mine Police.”  Alake further noted that the proposed security outfit will not be restricted to the mining sector, but its operation will cover marine and the blue economy.  He explained that the special police force will be controlled by the Ministry of Solid Minerals and its personnel will answer to officials of the Ministry.  Also, the minister said that the Ministry has provided a 60-day grace widow for illegal artisanal miners to organize themselves to become bankable and ensure they pay royalties and taxes to the government.  When questioned on what it takes for potential investors to get a mining license, he explained that the Ministry will overhaul the whole process of application and licensing and make it as easy as possible.  He said,“That one-stop shop will enable you at a glance to know the processes that you have to go through so that you don’t need to go from one department to the other and be wasting time.  “It will tell you how to do it, what you should do, the requirements, etc. And the licenses after completing your applications legitimately must not take more than 30 days for it to be issued.”  He harped on the importance of the licensing process and how critical it is to attract investors and promote the ease of doing business",
      "text": "Business\nFG plans special police force on illegal mining\nThe Federal Government has disclosed plans to create a special police outfit for the sole purpose of combating illegal mining across the country.\nThe Minister of Solid Minerals Development, Mr. Dele Alake disclosed this while speaking on the NTA Weekend File on strategies to be deployed by the Federal Government to increase the contribution of mining to the economy.\nWhile responding to questions concerning challenges in the mining sector, Alake said the issue of insecurity will be handled through collaboration with different security agencies and the establishment of a special police outfit for that purpose.\n“We found out through intelligence reports that some illegal miners are directly responsible for the upsurge of banditry in several parts of Nigeria,” he said.\n“That is why I have been working with the various security agencies and the National security adviser, the outfit we are coming up with, and the President is fully in support of this.\n“We are going to create a special police outfit. We’ll call it the Mining Police Force or the Mine Police.”\nAlake further noted that the proposed security outfit will not be restricted to the mining sector, but its operation will cover marine and the blue economy.\nHe explained that the special police force will be controlled by the Ministry of Solid Minerals and its personnel will answer to officials of the Ministry.\nAlso, the minister said that the Ministry has provided a 60-day grace widow for illegal artisanal miners to organize themselves to become bankable and ensure they pay royalties and taxes to the government.\nWhen questioned on what it takes for potential investors to get a mining license, he explained that the Ministry will overhaul the whole process of application and licensing and make it as easy as possible.\nHe said,“That one-stop shop will enable you at a glance to know the processes that you have to go through so that you don’t need to go from one department to the other and be wasting time.\n“It will tell you how to do it, what you should do, the requirements, etc. And the licenses after completing your applications legitimately must not take more than 30 days for it to be issued.”\nHe harped on the importance of the licensing process and how critical it is to attract investors and promote the ease of doing business",
      "language": null,
      "image": "https://dailypost.ng/wp-content/uploads/2021/03/Mining.jpg",
      "pagetype": "article",
      "source": "https://dailypost.ng/2023/11/05/fg-plans-special-police-force-on-illegal-mining/",
      "source-hostname": "Daily Post Nigeria",
      "excerpt": "The Federal Government has disclosed plans to create a special police outfit for the sole purpose of combating illegal mining across the country. The",
      "word-count": 1
    }
  },
  {
    "url": "https://politicsnigeria.com/expect-to-reap-fruits-of-tinubus-policies-from-next-year-senate-leader-tells-nigerians/",
    "extractedText": {
      "title": "“Expect to reap fruits of Tinubu’s policies from next year” - Senate leader tells Nigerians",
      "author": "Goodness Adaoyiche",
      "hostname": "politicsnigeria.com",
      "date": "2023-11-05",
      "categories": "News",
      "tags": "",
      "fingerprint": "139b982c70f3d608",
      "id": null,
      "license": null,
      "comments": "",
      "raw_text": "Senate leader, Opeyemi Bamidele, assured Nigerians of better days ahead.  Addressing journalists in Ilesa, Osun state, Senator Bamidele disclosed that Nigerians will begin to “reap” the fruits of President Bola Tinubu’s economic policies from next year.  While noting that Nigerians are experiencing difficult times due to the global economic crisis, Bamidele stressed that President Tinubu has a grasp of the situation and understand what is required to make life better for Nigerians.  According to him, Nigeria’s economy is going through difficult times, but the President know what is to be done to pull it out of the woods.  “The budget of year 2024 is going to be a budget of reality, that of a renewed hope and a budget that will help re-chat our course as a nation,” the senate leader said.  “There is no doubting the fact that this is an unusual time in the life of our country, the entire global economy is in crisis and Nigeria is not an exception, but when the going gets tough, it is said that the tough gets going.  “Difficult as the times are, it is also a time that will show the ingenuity of leadership and we have a leader today, in the person of President Bola Tinubu, who I know has a scientific understanding of what is to be done and will do Nigeria proud and will bring to bear, his own intellectual acumen in ensuring that our issues are addressed so life could become more meaningful for Nigerians”.  On the expectation of the 2024 budget, Bamidele noted that the proposal before the National Assembly has shown that it would not be business as usual.  “From the midterm expenditure framework that was sent to the National Assembly, it is obvious to us that it is going to be an unusual budget, a greater percentage was committed to capital development projects unlike in the past when so much percentage was committed to consumables. So, definitely, it is not going to be the same story again”, he said.",
      "text": "Senate leader, Opeyemi Bamidele, assured Nigerians of better days ahead.\nAddressing journalists in Ilesa, Osun state, Senator Bamidele disclosed that Nigerians will begin to “reap” the fruits of President Bola Tinubu’s economic policies from next year.\nWhile noting that Nigerians are experiencing difficult times due to the global economic crisis, Bamidele stressed that President Tinubu has a grasp of the situation and understand what is required to make life better for Nigerians.\nAccording to him, Nigeria’s economy is going through difficult times, but the President know what is to be done to pull it out of the woods.\n“The budget of year 2024 is going to be a budget of reality, that of a renewed hope and a budget that will help re-chat our course as a nation,” the senate leader said.\n“There is no doubting the fact that this is an unusual time in the life of our country, the entire global economy is in crisis and Nigeria is not an exception, but when the going gets tough, it is said that the tough gets going.\n“Difficult as the times are, it is also a time that will show the ingenuity of leadership and we have a leader today, in the person of President Bola Tinubu, who I know has a scientific understanding of what is to be done and will do Nigeria proud and will bring to bear, his own intellectual acumen in ensuring that our issues are addressed so life could become more meaningful for Nigerians”.\nOn the expectation of the 2024 budget, Bamidele noted that the proposal before the National Assembly has shown that it would not be business as usual.\n“From the midterm expenditure framework that was sent to the National Assembly, it is obvious to us that it is going to be an unusual budget, a greater percentage was committed to capital development projects unlike in the past when so much percentage was committed to consumables. So, definitely, it is not going to be the same story again”, he said.",
      "language": null,
      "image": "https://politicsnigeria.com/wp-content/uploads/2023/11/DC1443B9-57E4-48D8-BE20-EB7F30B9D908.jpeg",
      "pagetype": "article",
      "source": "https://politicsnigeria.com/expect-to-reap-fruits-of-tinubus-policies-from-next-year-senate-leader-tells-nigerians/",
      "source-hostname": "Politics Nigeria",
      "excerpt": "The Senate leader has said that Nigerians will begin to “reap” the fruits of President Bola Tinubu’s economic policies from next year.",
      "word-count": 1
    }
  },
  {
    "url": "https://sunnewsonline.com/exporter-decries-misuse-of-import-documents-for-soybean-shipments-to-india/",
    "extractedText": {
      "title": "Exporter decries misuse of import documents for Soybean shipments to India – The Sun Nigeria",
      "author": "Ajiri Daniels",
      "hostname": "sunnewsonline.com",
      "date": "2023-11-05",
      "categories": "National;Cover;Politics;Business;Sports;News;Food & Drinks;Gallery;Letters;Sporting Sun;Columns;World News;Features;Cartoons;Press Release;Sun Girl;Travel & Tourism;Trending;Entertainment;Events;Health;Lifestyle;Opinion;TSWeekend;Voices;World",
      "tags": "the sun,sun newspaper,nigerian news,politics,entertainment,business,politics,2023 Governorship Election",
      "fingerprint": "d4d805da0831255c",
      "id": null,
      "license": null,
      "comments": "",
      "raw_text": "By Steve Agbota In a move to address a growing concern within the soybean import industry, an exporter, Aarjun Aarav has decried the fake import duty documents used by unscrupulous importers to ship soybean into India. Investigations by Daily Sun revealed that Nigerian importers are falsifying import duty documents and bypass Customs to carryout the illegal importation to India. However, in a letter to the Department of Plant Protection, Ministry of Agriculture and Farmers Welfare, Government of India and letter obtained by our correspondent, the exporter highlighted a troubling issue regarding the misuse of import documents for soybean shipments into India, which threatens the integrity of the country’s import processes. The exporter noted that he has come across credible information suggesting that certain importers are using deceptive means to bypass Customs duties by using falsified documents. Of particular concern, he said is the misuse of phytosanitary certificates and other relevant documents purportedly from the Niger Republic to obtain duty exemptions on soybean imports. He stated that this is especially alarming as the Niger Republic, according to available records and data, does not produce soybeans. Instead, it has become evident that these soybean shipments originate from Nigeria, where Customs duties are applicable for soybean imports into India. “The use of counterfeit documents not only poses a threat to the revenue of the Indian government but also raises significant concerns about biosecurity and quality standards “The authenticity of the product’s origin and its quality checks can no longer be guaranteed, potentially jeopardizing the safety and health of consumers,” he stated. In the wake of these disconcerting revelations, the exporter implores the Department of Plant Protection to take immediate action. The exporter calls for a comprehensive investigation to trace back recent soybean imports documented as originating from the Niger Republic. He said this investigation aims to identify the entities responsible for the use of fraudulent documentation. The exporter also urge the department to take stringent action against the entities found guilty of using fraudulent documentation. He stated that legal measures should be implemented to deter such activities in the future. Aarav also emphasizes the importance of enhancing monitoring mechanisms to prevent similar incidents in the future. He stated that tightening control over the import process will ensure that fraudulent practices are promptly detected and prevented. The exporter’s plea underscores the critical need to maintain the integrity of India’s import processes and to swiftly address deceptive practices that threaten the nation’s revenue and biosecurity.",
      "text": "By Steve Agbota\nIn a move to address a growing concern within the soybean import industry, an exporter, Aarjun Aarav has decried the fake import duty documents used by unscrupulous importers to ship soybean into India.\nInvestigations by Daily Sun revealed that Nigerian importers are falsifying import duty documents and bypass Customs to carryout the illegal importation to India.\nHowever, in a letter to the Department of Plant Protection, Ministry of Agriculture and Farmers Welfare, Government of India and letter obtained by our correspondent, the exporter highlighted a troubling issue regarding the misuse of import documents for soybean shipments into India, which threatens the integrity of the country’s import processes.\nThe exporter noted that he has come across credible information suggesting that certain importers are using deceptive means to bypass Customs duties by using falsified documents.\nOf particular concern, he said is the misuse of phytosanitary certificates and other relevant documents purportedly from the Niger Republic to obtain duty exemptions on soybean imports.\nHe stated that this is especially alarming as the Niger Republic, according to available records and data, does not produce soybeans. Instead, it has become evident that these soybean shipments originate from Nigeria, where Customs duties are applicable for soybean imports into India.\n“The use of counterfeit documents not only poses a threat to the revenue of the Indian government but also raises significant concerns about biosecurity and quality standards\n“The authenticity of the product’s origin and its quality checks can no longer be guaranteed, potentially jeopardizing the safety and health of consumers,” he stated.\nIn the wake of these disconcerting revelations, the exporter implores the Department of Plant Protection to take immediate action.\nThe exporter calls for a comprehensive investigation to trace back recent soybean imports documented as originating from the Niger Republic.\nHe said this investigation aims to identify the entities responsible for the use of fraudulent documentation.\nThe exporter also urge the department to take stringent action against the entities found guilty of using fraudulent documentation. He stated that legal measures should be implemented to deter such activities in the future.\nAarav also emphasizes the importance of enhancing monitoring mechanisms to prevent similar incidents in the future.\nHe stated that tightening control over the import process will ensure that fraudulent practices are promptly detected and prevented.\nThe exporter’s plea underscores the critical need to maintain the integrity of India’s import processes and to swiftly address deceptive practices that threaten the nation’s revenue and biosecurity.",
      "language": null,
      "image": "https://assets.sunnewsonline.com/wp-content/uploads/2023/07/export-business.jpg",
      "pagetype": "article",
      "source": "https://sunnewsonline.com/exporter-decries-misuse-of-import-documents-for-soybean-shipments-to-india/",
      "source-hostname": "The Sun Nigeria",
      "excerpt": "By Steve Agbota In a move to address a growing concern within the soybean import industry, an exporter, Aarjun Aarav has decried the fake import duty documents used by unscrupulous importers to ship soybean into India. Investigations by Daily Sun revealed that Nigerian importers are falsifying import duty documents and bypass Customs to carryout the […]",
      "word-count": 1
    }
  },
  {
    "url": "https://blueprint.ng/nigerias-gas-deposit-can-power-industries-transport-for-97-years-fg/",
    "extractedText": {
      "title": "Nigeria’s gas deposit can power industries, transport for 97 years – FG",
      "author": "AbdulRaheem Aodu; Content Administrator I",
      "hostname": "blueprint.ng",
      "date": "2023-11-05",
      "categories": "Business",
      "tags": "Benefits;exporting job and importing poverty;Policy",
      "fingerprint": "a9de8150dcb0c33b",
      "id": null,
      "license": null,
      "comments": "",
      "raw_text": "The Federal Government has unveiled the first Compressed Natural Gas (CNG) Conversion Centre in the North-west, while stating that Nigeria’s huge gas deposit can power the nation’s transportation and industrial sectors for 97 years, at a cheaper rate than petrol. The Project Director, Presidential Compressed Natural Gas Initiative (P-CNGi), Engr. Michael Oluwagbemi, who stated this while breaking ground for construction of the CNG Conversion Center in Kakau, Chikun local government area of Kaduna state by Rolling Energy Providers Ltd Kaduna, said the huge gas deposit across the country, which is cheaper and safer informed President Bola Tinubu’s resolve to invest in the use of CNG as alternative to fuel in the two sectors. He said Nigeria sat on 6 trillion ft³ of gas, the largest gas deposit in Africa, adding that to effectively serve Nigeria there is need for 1,000 CNG conversion centers across the country, which will in turn provide at least 10,000 direct jobs and hundreds of thousands of jobs in the CNG value chain. When completed, the CNG vehicle conversion centre will convert petrol vehicles to dual fuel engine, enabling them to run on either CNG or Premium Motor Spirit (PMS). Oluwagbemi noted that the Federal Government is piloting the conversion of the PMS vehicles to gas engines through its palliative project, captured in the 2023 supplementary budget, adding that under that project, 55,000 vehicles will be converted at subsidized rate. “Nigeria is a gas country, as it sits on over 6 trillion ft³ of gas, 30 states have the gas resource. There is gas everywhere from Akwa Ibom to Ogun, from Sokoto to Bayelsa states. Our movenent to natural gas is movement to Nigeria’s own resources and stoppage of reliance on foreign energy. “Nigeria is long overdue for this gas revolution, we are a gas country that happens to have crude oil. We have gas in large quantity that can last us for 97 years if fully utilized. So, we should take gas seriously for industrialization and transportation. Natural gas is safe, lighter than air, not combustible, cleaner and 40% cheaper than pms. It sold in Abuja now for about N230 to N280 per kg. “President Tinubu had after the sound economic policy of fuel subsidy removal that was importing foreign fuel into Nigeria, to be smuggled to neighbouring countries, exporting job and importing poverty, decided to replace it with use of gas for the benefit of Nigerians and development of Nigeria. We are going to convert 55,000 vehicles at discounted rate. While over 11,500 platforms, including buses and tricycles that will be using CNG will be procured. President Tinubu targets conversion of 1 million out of 17 million vehicles plying Nigerian roads before the end of 2027.” The Chief Executive Officer, Rolling Energy Limited and Proprietor of the Conversion Centre, Mubarak Umar said his firm is committed to assisting the Federal Government towards delivering the CNG programme, saying that his company will be building six additional centres across the country within a year.",
      "text": "The Federal Government has unveiled the first Compressed Natural Gas (CNG) Conversion Centre in the North-west, while stating that Nigeria’s huge gas deposit can power the nation’s transportation and industrial sectors for 97 years, at a cheaper rate than petrol.\nThe Project Director, Presidential Compressed Natural Gas Initiative (P-CNGi), Engr. Michael Oluwagbemi, who stated this while breaking ground for construction of the CNG Conversion Center in Kakau, Chikun local government area of Kaduna state by Rolling Energy Providers Ltd Kaduna, said the huge gas deposit across the country, which is cheaper and safer informed President Bola Tinubu’s resolve to invest in the use of CNG as alternative to fuel in the two sectors.\nHe said Nigeria sat on 6 trillion ft³ of gas, the largest gas deposit in Africa, adding that to effectively serve Nigeria there is need for 1,000 CNG conversion centers across the country, which will in turn provide at least 10,000 direct jobs and hundreds of thousands of jobs in the CNG value chain. When completed, the CNG vehicle conversion centre will convert petrol vehicles to dual fuel engine, enabling them to run on either CNG or Premium Motor Spirit (PMS).\nOluwagbemi noted that the Federal Government is piloting the conversion of the PMS vehicles to gas engines through its palliative project, captured in the 2023 supplementary budget, adding that under that project, 55,000 vehicles will be converted at subsidized rate.\n“Nigeria is a gas country, as it sits on over 6 trillion ft³ of gas, 30 states have the gas resource. There is gas everywhere from Akwa Ibom to Ogun, from Sokoto to Bayelsa states. Our movenent to natural gas is movement to Nigeria’s own resources and stoppage of reliance on foreign energy.\n“Nigeria is long overdue for this gas revolution, we are a gas country that happens to have crude oil. We have gas in large quantity that can last us for 97 years if fully utilized. So, we should take gas seriously for industrialization and transportation. Natural gas is safe, lighter than air, not combustible, cleaner and 40% cheaper than pms. It sold in Abuja now for about N230 to N280 per kg.\n“President Tinubu had after the sound economic policy of fuel subsidy removal that was importing foreign fuel into Nigeria, to be smuggled to neighbouring countries, exporting job and importing poverty, decided to replace it with use of gas for the benefit of Nigerians and development of Nigeria. We are going to convert 55,000 vehicles at discounted rate. While over 11,500 platforms, including buses and tricycles that will be using CNG will be procured. President Tinubu targets conversion of 1 million out of 17 million vehicles plying Nigerian roads before the end of 2027.”\nThe Chief Executive Officer, Rolling Energy Limited and Proprietor of the Conversion Centre, Mubarak Umar said his firm is committed to assisting the Federal Government towards delivering the CNG programme, saying that his company will be building six additional centres across the country within a year.",
      "language": null,
      "image": "https://i0.wp.com/blueprint.ng/wp-content/uploads/2023/11/IMG_20231104_150135-scaled.jpg?fit=1200%2C900&ssl=1",
      "pagetype": "article",
      "source": "https://blueprint.ng/nigerias-gas-deposit-can-power-industries-transport-for-97-years-fg/",
      "source-hostname": "Blueprint Newspapers Limited",
      "excerpt": "The Federal Government has unveiled the first Compressed Natural Gas (CNG) Conversion Centre in the North-west, while stating that Nigeria’s huge gas deposit can power the nation’s transportation…",
      "word-count": 1
    }
  },
  {
    "url": "https://dailypost.ng/2023/11/05/group-sues-customs-over-restriction-of-petroleum-products-in-ogun-communities/",
    "extractedText": {
      "title": "Group sues Customs over restriction of petroleum products in Ogun communities",
      "author": "Musliudeen Adebayo",
      "hostname": "dailypost.ng",
      "date": "2023-11-05",
      "categories": "News",
      "tags": "",
      "fingerprint": "409aebd9e7796b87",
      "id": null,
      "license": null,
      "comments": "",
      "raw_text": "News  Group sues Customs over restriction of petroleum products in Ogun communities  A group, All Youths Re-Oriented Initiative (AYRIN), has dragged the Nigeria Customs Service Board and the Comptroller- General of Nigeria Customs Service to court over a directive against movement of fuel and petroleum products in communities close to the borders across the country.  DAILY POST reports that the defendants in the suit are the Nigeria Customs Service Board and the Comptroller- General of Nigeria Customs Service.  The suit was filled at the Federal High Court in Abeokuta, Ogun State. The claimants, in the suit numbered FHC/AB/CS/87/23 filed by their counsel, Izunya Izunya and co, are asking the court to decide whether it is not discriminatory, illegal and unconstitutional for Nigerians who reside in communities of any distance from Nigerian border to be deprived of buying, selling or having access to petroleum products.  The plaintiffs, in the suit filed on behalf of themselves and other Nigerians residing in border communities across the country, are also asking the court to decide: “Whether the circular issued by the 1st & 2nd defendant preventing petrol tankers from dispensing fuel in communities in Nigeria within twenty (20) kilometers from Nigeria border is not illegal, unconstitutional and contrary to section 42 and 43 of 1999 constitution of Nigeria (as amended)  “Whether the prevention of fuel from entering 20 kilometers within border area has not caused untold economic, social and psychological pain, hardship and suffering on Nigerians residing within border area and any other order or further orders as the Honourable Court may deem fit to make in the circumstances.”  The plaintiffs are also seeking a declaration by the court that the circular No.027 issued by the 1st and 2nd defendant dated 6th day of September 2019 preventing petrol tankers from taking fuel to filling stations, selling and buying fuel within twenty kilometers from Nigeria Borders with other countries, is illegal, unconstitutional, null and void.  The group argued that such circular is contrary to section 1 (1) & (3) and section 42 of the 1999 constitution of Nigeria (as Amended), stressing that the defendants have no justification under any law to issue such circular.  DAILY POST reports that the suit was supported with an affidavit by Oguntoyinbo Olufemi Ajadi, who is the President of the group.  Ajadi in the affidavit made available to DAILY POST on Sunday stated that he has the consent of all members of the group to depose to the affidavit at the court.  He added that the group has members cut across the affected areas in Ogun State and beyond.  Some of the affected areas in Ogun State according to him are; llaro, Afon, Owode-idiroko, Ajegunle Ajilete, Wasimi-Okuta, Iwoye, Okeagbede, Idofa and Imeko.  He said, “The filing of this suit is within the aims and objectives of the plaintiff as contained in exhibit B of paragraph 3 above; that the plaintiff has members within all areas affected by the act of the defendants and outside Ogun State and that the members of the plaintiff are not in one location but spread across different local governments, villages, towns and cities in Ogun State including but not limited to llaro, Afon, Owode-idiroko, Ajegunle Ajilete, Wasimi-Okuta, Iwoye, Okeagbede, Idofa, Imeko etc.”",
      "text": "News\nGroup sues Customs over restriction of petroleum products in Ogun communities\nA group, All Youths Re-Oriented Initiative (AYRIN), has dragged the Nigeria Customs Service Board and the Comptroller- General of Nigeria Customs Service to court over a directive against movement of fuel and petroleum products in communities close to the borders across the country.\nDAILY POST reports that the defendants in the suit are the Nigeria Customs Service Board and the Comptroller- General of Nigeria Customs Service.\nThe suit was filled at the Federal High Court in Abeokuta, Ogun State.\nThe claimants, in the suit numbered FHC/AB/CS/87/23 filed by their counsel, Izunya Izunya and co, are asking the court to decide whether it is not discriminatory, illegal and unconstitutional for Nigerians who reside in communities of any distance from Nigerian border to be deprived of buying, selling or having access to petroleum products.\nThe plaintiffs, in the suit filed on behalf of themselves and other Nigerians residing in border communities across the country, are also asking the court to decide: “Whether the circular issued by the 1st & 2nd defendant preventing petrol tankers from dispensing fuel in communities in Nigeria within twenty (20) kilometers from Nigeria border is not illegal, unconstitutional and contrary to section 42 and 43 of 1999 constitution of Nigeria (as amended)\n“Whether the prevention of fuel from entering 20 kilometers within border area has not caused untold economic, social and psychological pain, hardship and suffering on Nigerians residing within border area and any other order or further orders as the Honourable Court may deem fit to make in the circumstances.”\nThe plaintiffs are also seeking a declaration by the court that the circular No.027 issued by the 1st and 2nd defendant dated 6th day of September 2019 preventing petrol tankers from taking fuel to filling stations, selling and buying fuel within twenty kilometers from Nigeria Borders with other countries, is illegal, unconstitutional, null and void.\nThe group argued that such circular is contrary to section 1 (1) & (3) and section 42 of the 1999 constitution of Nigeria (as Amended), stressing that the defendants have no justification under any law to issue such circular.\nDAILY POST reports that the suit was supported with an affidavit by Oguntoyinbo Olufemi Ajadi, who is the President of the group.\nAjadi in the affidavit made available to DAILY POST on Sunday stated that he has the consent of all members of the group to depose to the affidavit at the court.\nHe added that the group has members cut across the affected areas in Ogun State and beyond.\nSome of the affected areas in Ogun State according to him are; llaro, Afon, Owode-idiroko, Ajegunle Ajilete, Wasimi-Okuta, Iwoye, Okeagbede, Idofa and Imeko.\nHe said, “The filing of this suit is within the aims and objectives of the plaintiff as contained in exhibit B of paragraph 3 above; that the plaintiff has members within all areas affected by the act of the defendants and outside Ogun State and that the members of the plaintiff are not in one location but spread across different local governments, villages, towns and cities in Ogun State including but not limited to llaro, Afon, Owode-idiroko, Ajegunle Ajilete, Wasimi-Okuta, Iwoye, Okeagbede, Idofa, Imeko etc.”",
      "language": null,
      "image": "https://dailypost.ng/wp-content/uploads/2023/11/IMG-20231105-WA0023.jpg",
      "pagetype": "article",
      "source": "https://dailypost.ng/2023/11/05/group-sues-customs-over-restriction-of-petroleum-products-in-ogun-communities/",
      "source-hostname": "Daily Post Nigeria",
      "excerpt": "A group, All Youths Re-Oriented Initiative (AYRIN), has dragged the Nigeria Customs Service Board and the Comptroller- General of Nigeria Customs Service",
      "word-count": 1
    }
  }
]
